iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_audio.c
#define DFSDM_CLOCK_DIVIDER(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))  ? (24U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K)) ? (4U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K)) ? (24U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K)) ? (4U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K)) ? (24U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K)) ? (4U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K)) ? (25U) : (25U)

#define DFSDM_FILTER_ORDER(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))  ? (DFSDM_FILTER_SINC3_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K)) ? (DFSDM_FILTER_SINC3_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K)) ? (DFSDM_FILTER_SINC3_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K)) ? (DFSDM_FILTER_SINC3_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K)) ? (DFSDM_FILTER_SINC4_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K)) ? (DFSDM_FILTER_SINC3_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K)) ? (DFSDM_FILTER_SINC3_ORDER) : (DFSDM_FILTER_SINC5_ORDER)

#define DFSDM_MIC_BIT_SHIFT(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))  ? (6U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K)) ? (8U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K)) ? (3U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K)) ? (4U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K)) ? (7U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K)) ? (0U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K)) ? (0U) : (4U)

/* Saturate the record PCM sample */
#define SaturaLH(N, L, H) (((N)<(L))?(L):(((N)>(H))?(H):(N)))
/**
  * @}
  */

/** @defgroup STM32H743I_EVAL_AUDIO_Exported_Variables Exported Variables
  * @{
  */

/* Play  */
SAI_HandleTypeDef                      haudio_out_sai = {0};
AUDIO_OUT_Ctx_t                        Audio_Out_Ctx[AUDIO_OUT_INSTANCES_NBR];

/* Record */
DFSDM_Filter_HandleTypeDef             haudio_in_dfsdm_filter[DFSDM_MIC_NUMBER];
DFSDM_Channel_HandleTypeDef            haudio_in_dfsdm_channel[DFSDM_MIC_NUMBER];
SAI_HandleTypeDef                      haudio_in_sai;
AUDIO_IN_Ctx_t                         Audio_In_Ctx[AUDIO_IN_INSTANCES_NBR];

/**
  * @}
  */

/** @defgroup STM32H743I_EVAL_AUDIO_Private_Variables Private Variables
  * @{
  */
static AUDIO_Drv_t                     *Audio_Drv = NULL;
/* Audio in and out component object */
void                            *Audio_CompObj = NULL;
/* Recording DFSDM DMA handles */
static DMA_HandleTypeDef               hDmaDfsdm[DFSDM_MIC_NUMBER];

/* Recording Buffer Trigger */
static __IO uint32_t                   RecBuffTrigger          = 0;
static __IO uint32_t                   RecBuffHalf             = 0;
ALIGN_32BYTES (static int32_t          MicRecBuff[2][DEFAULT_AUDIO_IN_BUFFER_SIZE]);

/* PDM filters params */
static PDM_Filter_Handler_t            PDM_FilterHandler[2];
static PDM_Filter_Config_t             PDM_FilterConfig[2];
/**
  * @}
  */

/** @defgroup STM32H743I_EVAL_AUDIO_Private_Function_Prototypes Private Function Prototypes
  * @{
  */
/* SAI Msp config */
static void SAI_MspInit(SAI_HandleTypeDef *hsai);
static void SAI_MspDeInit(SAI_HandleTypeDef *hsai);
static void SAI_InitMXConfigStruct(SAI_HandleTypeDef* hsai, MX_SAI_Config *MXConfig);

/* SAI callbacks */
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1U)
static void SAI_TxCpltCallback(SAI_HandleTypeDef *hsai);
static void SAI_TxHalfCpltCallback(SAI_HandleTypeDef *hsai);
static void SAI_RxCpltCallback(SAI_HandleTypeDef *hsai);
static void SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai);
static void SAI_ErrorCallback(SAI_HandleTypeDef *hsai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1U) */

/* DFSDM Channel Msp config */
static void DFSDM_ChannelMspInit(DFSDM_Channel_HandleTypeDef *hDfsdmChannel);
static void DFSDM_ChannelMspDeInit(DFSDM_Channel_HandleTypeDef *hDfsdmChannel);

/* DFSDM Filter Msp config */
static void DFSDM_FilterMspInit(DFSDM_Filter_HandleTypeDef *hDfsdmFilter);
static void DFSDM_FilterMspDeInit(DFSDM_Filter_HandleTypeDef *hDfsdmFilter);

/* DFSDM Filter conversion callbacks */
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
static void DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
static void DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter);
#endif /* (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1) */

#if (USE_AUDIO_CODEC_WM8994 == 1)
static int32_t WM8994_Probe(void);
#endif
#if (USE_AUDIO_CODEC_ADV7533 == 1)
static int32_t ADV7533_Probe(void);
#endif

/**
  * @}
  */

/** @defgroup STM32H743I_EVAL_AUDIO_OUT_Exported_Functions AUDIO_OUT Exported Functions
  * @{
  */

/**
  * @brief  Configures the audio peripherals.
  * @param  Instance   AUDIO OUT Instance. It can only be 0 (SAI)
  * @param  AudioInit  AUDIO OUT init Structure
  * @retval BSP status
  */
int32_t BSP_AUDIO_OUT_Init(uint32_t Instance, BSP_AUDIO_Init_t* AudioInit)
{
 if(Instance >= AUDIO_OUT_INSTANCES_NBR)
 {
   return BSP_ERROR_WRONG_PARAM;
 }
 else
 {
   /* Fill Audio_Out_Ctx structure */
   Audio_Out_Ctx[Instance].Device         = AudioInit->Device;
   Audio_Out_Ctx[Instance].Instance       = Instance;
   Audio_Out_Ctx[Instance].SampleRate     = AudioInit->SampleRate;
   Audio_Out_Ctx[Instance].BitsPerSample  = AudioInit->BitsPerSample;
   Audio_Out_Ctx[Instance].ChannelsNbr    = AudioInit->ChannelsNbr;
   Audio_Out_Ctx[Instance].Volume         = AudioInit->Volume;
   Audio_Out_Ctx[Instance].State          = AUDIO_OUT_STATE_RESET;

   if(AudioInit->Device != AUDIO_OUT_DEVICE_HDMI)
   {
#if (USE_AUDIO_CODEC_WM8994 == 1)
     if(WM8994_Probe() != BSP_ERROR_NONE)
     {
       return BSP_ERROR_COMPONENT_FAILURE;
     }
#endif
   }

   /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
   if(MX_SAI1_ClockConfig(&haudio_out_sai, AudioInit->SampleRate) != HAL_OK)
   {
     return BSP_ERROR_CLOCK_FAILURE;
   }
   /* SAI data transfer preparation:
   Prepare the Media to be used for the audio transfer from memory to SAI peripheral */
   haudio_out_sai.Instance = AUDIO_OUT_SAIx;

#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1U)
   /* Register the SAI MSP Callbacks */
   if(Audio_Out_Ctx[Instance].IsMspCallbacksValid == 0U)
   {
     if(BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
     {
       return BSP_ERROR_PERIPH_FAILURE;
     }
   }
#else
   SAI_MspInit(&haudio_out_sai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1U) */

   MX_SAI_Config mx_sai_config;

   /* Prepare haudio_out_sai handle */
   mx_sai_config.AudioFrequency    = AudioInit->SampleRate;
   mx_sai_config.AudioMode         = SAI_MODEMASTER_TX;
   mx_sai_config.ClockStrobing     = SAI_CLOCKSTROBING_RISINGEDGE;
   mx_sai_config.MonoStereoMode    = SAI_STEREOMODE;
   mx_sai_config.DataSize          = SAI_DATASIZE_16;
   mx_sai_config.FrameLength       = 128;
   mx_sai_config.ActiveFrameLength = 64;
   if (AudioInit->BitsPerSample == AUDIO_RESOLUTION_32B)
   {
     mx_sai_config.DataSize          = SAI_DATASIZE_32;
     mx_sai_config.FrameLength       = 128;
     mx_sai_config.ActiveFrameLength = 64;
   }
   if(AudioInit->ChannelsNbr == 1U)
   {
     mx_sai_config.MonoStereoMode = SAI_MONOMODE;
   }
   mx_sai_config.OutputDrive       = SAI_OUTPUTDRIVE_ENABLE;
   mx_sai_config.Synchro           = SAI_ASYNCHRONOUS;
   mx_sai_config.SynchroExt        = SAI_SYNCEXT_DISABLE;

   switch(AudioInit->Device)
   {
   case AUDIO_OUT_DEVICE_SPK_HP:
   case AUDIO_OUT_DEVICE_AUTO:
     mx_sai_config.SlotActive         = CODEC_AUDIOFRAME_SLOT_0123;
     break;
   case AUDIO_OUT_DEVICE_SPEAKER:
     mx_sai_config.SlotActive         = CODEC_AUDIOFRAME_SLOT_13;
     break;
   case AUDIO_OUT_DEVICE_HEADPHONE:
   default:
     mx_sai_config.SlotActive         = CODEC_AUDIOFRAME_SLOT_02;
     break;
   }

   /* SAI peripheral initialization: this __weak function can be redefined by the application  */
   if(MX_SAI1_Block_A_Init(&haudio_out_sai, &mx_sai_config) != HAL_OK)
   {
     return BSP_ERROR_PERIPH_FAILURE;
   }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1U)
   /* Register SAI TC, HT and Error callbacks */
   if(HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_COMPLETE_CB_ID, SAI_TxCpltCallback) != HAL_OK)
   {
     return BSP_ERROR_PERIPH_FAILURE;
   }
   if(HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_TX_HALFCOMPLETE_CB_ID, SAI_TxHalfCpltCallback) != HAL_OK)
   {
     return BSP_ERROR_PERIPH_FAILURE;
   }
   if(HAL_SAI_RegisterCallback(&haudio_out_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
   {
     return BSP_ERROR_PERIPH_FAILURE;
   }
#endif


#if (USE_AUDIO_CODEC_WM8994 == 1)
   WM8994_Init_t codec_init;
   if(AudioInit->Device != AUDIO_OUT_DEVICE_HDMI)
   {
     switch (AudioInit->BitsPerSample)
     {
     case AUDIO_RESOLUTION_32B:
       codec_init.Resolution   = 3;
       break;

     case AUDIO_RESOLUTION_16B:
     default:
       codec_init.Resolution   = 0;
       break;
     }
     /* Fill codec_init structure */
     codec_init.Frequency    = AudioInit->SampleRate;
     codec_init.InputDevice  = WM8994_IN_NONE;
     codec_init.OutputDevice = AudioInit->Device;

     /* Convert volume before sending to the codec */
     codec_init.Volume       = VOLUME_OUT_CONVERT(AudioInit->Volume);

     /* Initialize the codec internal registers */
     if(Audio_Drv->Init(Audio_CompObj, &codec_init) != 0)
     {
       return BSP_ERROR_COMPONENT_FAILURE;
     }
   }
#endif
#if (USE_AUDIO_CODEC_ADV7533 == 1)
    if(ADV7533_Probe() == BSP_ERROR_NONE)
    {
      ADV7533_Init_t codec_init;

      /* Fill codec_init structure */
      codec_init.Frequency    = AudioInit->SampleRate;

      /* Initialize the codec internal registers */
      if(Audio_Drv->Init(Audio_CompObj, &codec_init) != 0)
      {
        return BSP_ERROR_COMPONENT_FAILURE;
      }
    }
#endif
    /* Update BSP AUDIO OUT state */
    Audio_Out_Ctx[Instance].State = AUDIO_OUT_STATE_STOP;
  }

